node {
  name: "Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1
          }
        }
        string_val: "./data/tfrecords/fc_sample.tfrecords"
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/Size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/Greater/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/Greater"
  op: "Greater"
  input: "load_batch/parallel_read/filenames/Size"
  input: "load_batch/parallel_read/filenames/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/Assert/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/Assert/Assert"
  op: "Assert"
  input: "load_batch/parallel_read/filenames/Greater"
  input: "load_batch/parallel_read/filenames/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/Identity"
  op: "Identity"
  input: "load_batch/parallel_read/filenames/Const"
  input: "^load_batch/parallel_read/filenames/Assert/Assert"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/RandomShuffle"
  op: "RandomShuffle"
  input: "load_batch/parallel_read/filenames/Identity"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames"
  op: "FIFOQueueV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/filenames_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "load_batch/parallel_read/filenames"
  input: "load_batch/parallel_read/filenames/RandomShuffle"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/filenames_Close"
  op: "QueueCloseV2"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/filenames_Close_1"
  op: "QueueCloseV2"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/filenames_Size"
  op: "QueueSizeV2"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/ToFloat"
  op: "Cast"
  input: "load_batch/parallel_read/filenames/filenames_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/mul"
  op: "Mul"
  input: "load_batch/parallel_read/filenames/ToFloat"
  input: "load_batch/parallel_read/filenames/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/fraction_of_32_full/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "load_batch/parallel_read/filenames/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/filenames/fraction_of_32_full"
  op: "ScalarSummary"
  input: "load_batch/parallel_read/filenames/fraction_of_32_full/tags"
  input: "load_batch/parallel_read/filenames/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue"
  op: "RandomShuffleQueueV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 1024
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "min_after_dequeue"
    value {
      i: 512
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "shapes"
    value {
      list {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_Size"
  op: "QueueSizeV2"
  input: "load_batch/parallel_read/common_queue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/ToFloat"
  op: "Cast"
  input: "load_batch/parallel_read/common_queue_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0009765625
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/mul"
  op: "Mul"
  input: "load_batch/parallel_read/ToFloat"
  input: "load_batch/parallel_read/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/fraction_of_1024_full/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "load_batch/parallel_read/fraction_of_1024_full"
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/fraction_of_1024_full"
  op: "ScalarSummary"
  input: "load_batch/parallel_read/fraction_of_1024_full/tags"
  input: "load_batch/parallel_read/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_1"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_2"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_3"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_4"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_5"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_6"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_7"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_8"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_9"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_10"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_11"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_12"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_13"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_14"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/TFRecordReaderV2_15"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: "ZLIB"
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2"
  input: "load_batch/parallel_read/ReaderReadV2:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_1"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_1"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_1"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_1"
  input: "load_batch/parallel_read/ReaderReadV2_1:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_2"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_2"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_2"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_2"
  input: "load_batch/parallel_read/ReaderReadV2_2:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_3"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_3"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_3"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_3"
  input: "load_batch/parallel_read/ReaderReadV2_3:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_4"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_4"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_4"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_4"
  input: "load_batch/parallel_read/ReaderReadV2_4:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_5"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_5"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_5"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_5"
  input: "load_batch/parallel_read/ReaderReadV2_5:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_6"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_6"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_6"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_6"
  input: "load_batch/parallel_read/ReaderReadV2_6:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_7"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_7"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_7"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_7"
  input: "load_batch/parallel_read/ReaderReadV2_7:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_8"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_8"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_8"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_8"
  input: "load_batch/parallel_read/ReaderReadV2_8:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_9"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_9"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_9"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_9"
  input: "load_batch/parallel_read/ReaderReadV2_9:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_10"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_10"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_10"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_10"
  input: "load_batch/parallel_read/ReaderReadV2_10:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_11"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_11"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_11"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_11"
  input: "load_batch/parallel_read/ReaderReadV2_11:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_12"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_12"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_12"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_12"
  input: "load_batch/parallel_read/ReaderReadV2_12:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_13"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_13"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_13"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_13"
  input: "load_batch/parallel_read/ReaderReadV2_13:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_14"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_14"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_14"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_14"
  input: "load_batch/parallel_read/ReaderReadV2_14:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/ReaderReadV2_15"
  op: "ReaderReadV2"
  input: "load_batch/parallel_read/TFRecordReaderV2_15"
  input: "load_batch/parallel_read/filenames"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_enqueue_15"
  op: "QueueEnqueueV2"
  input: "load_batch/parallel_read/common_queue"
  input: "load_batch/parallel_read/ReaderReadV2_15"
  input: "load_batch/parallel_read/ReaderReadV2_15:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_Close"
  op: "QueueCloseV2"
  input: "load_batch/parallel_read/common_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_Close_1"
  op: "QueueCloseV2"
  input: "load_batch/parallel_read/common_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "load_batch/parallel_read/common_queue_Dequeue"
  op: "QueueDequeueV2"
  input: "load_batch/parallel_read/common_queue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "load_batch/ParseSingleExample/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/ParseSingleExample/Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/ParseSingleExample/Const_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/ParseSingleExample/ParseSingleExample"
  op: "ParseSingleExample"
  input: "load_batch/parallel_read/common_queue_Dequeue:1"
  input: "load_batch/ParseSingleExample/Const"
  input: "load_batch/ParseSingleExample/Const_1"
  input: "load_batch/ParseSingleExample/Const_2"
  attr {
    key: "Tdense"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "dense_keys"
    value {
      list {
        s: "flow"
        s: "image_a"
        s: "image_b"
      }
    }
  }
  attr {
    key: "dense_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "num_sparse"
    value {
      i: 0
    }
  }
  attr {
    key: "sparse_keys"
    value {
      list {
      }
    }
  }
  attr {
    key: "sparse_types"
    value {
      list {
      }
    }
  }
}
node {
  name: "load_batch/Reshape/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/Reshape"
  op: "Reshape"
  input: "load_batch/ParseSingleExample/ParseSingleExample"
  input: "load_batch/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/Reshape_1/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/Reshape_1"
  op: "Reshape"
  input: "load_batch/ParseSingleExample/ParseSingleExample:1"
  input: "load_batch/Reshape_1/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/Reshape_2/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/Reshape_2"
  op: "Reshape"
  input: "load_batch/ParseSingleExample/ParseSingleExample:2"
  input: "load_batch/Reshape_2/shape"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "load_batch/DecodeRaw"
  op: "DecodeRaw"
  input: "load_batch/Reshape_1"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "little_endian"
    value {
      b: true
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "load_batch/Reshape_3/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\200\001\000\000\000\002\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "load_batch/Reshape_3"
  op: "Reshape"
  input: "load_batch/DecodeRaw"
  input: "load_batch/Reshape_3/shape"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 384
          }
          dim {
            size: 512
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/DecodeRaw_1"
  op: "DecodeRaw"
  input: "load_batch/Reshape_2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "little_endian"
    value {
      b: true
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "load_batch/Reshape_4/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\200\001\000\000\000\002\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "load_batch/Reshape_4"
  op: "Reshape"
  input: "load_batch/DecodeRaw_1"
  input: "load_batch/Reshape_4/shape"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 384
          }
          dim {
            size: 512
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/DecodeRaw_2"
  op: "DecodeRaw"
  input: "load_batch/Reshape"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "little_endian"
    value {
      b: true
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "load_batch/Reshape_5/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\200\001\000\000\000\002\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "load_batch/Reshape_5"
  op: "Reshape"
  input: "load_batch/DecodeRaw_2"
  input: "load_batch/Reshape_5/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 384
          }
          dim {
            size: 512
          }
          dim {
            size: 2
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/ToFloat"
  op: "Cast"
  input: "load_batch/Reshape_3"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 384
          }
          dim {
            size: 512
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/ToFloat_1"
  op: "Cast"
  input: "load_batch/Reshape_4"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 384
          }
          dim {
            size: 512
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "load_batch/ExpandDims"
  op: "ExpandDims"
  input: "load_batch/ToFloat"
  input: "load_batch/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 384
          }
          dim {
            size: 512
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "load_batch/ExpandDims_1"
  op: "ExpandDims"
  input: "load_batch/ToFloat_1"
  input: "load_batch/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 384
          }
          dim {
            size: 512
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/ExpandDims_2/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "load_batch/ExpandDims_2"
  op: "ExpandDims"
  input: "load_batch/Reshape_5"
  input: "load_batch/ExpandDims_2/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 384
          }
          dim {
            size: 512
          }
          dim {
            size: 2
          }
        }
      }
    }
  }
}
node {
  name: "load_batch/DataAugmentation"
  op: "DataAugmentation"
  input: "load_batch/ExpandDims"
  input: "load_batch/ExpandDims_1"
  input: "global_step/read"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 320
          }
          dim {
            size: 448
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 1
          }
          dim {
            size: 320
          }
          dim {
            size: 448
          }
          dim {
            size: 3
          }
        }
        shape {
          dim {
            size: 1
          }
          dim {
            size: 6
          }
        }
        shape {
          dim {
            size: 1
          }
          dim {
            size: 6
          }
        }
      }
    }
  }
  attr {
    key: "crop"
    value {
      list {
        i: 320
        i: 448
      }
    }
  }
  attr {
    key: "params_a_coeff_schedule"
    value {
      list {
      }
    }
  }
  attr {
    key: "params_a_exp"
    value {
      list {
        b: false
        b: false
        b: true
        b: true
        b: false
      }
    }
  }
  attr {
    key: "params_a_mean"
    value {
      list {
        f: 0.0
        f: 0.0
        f: 0.2
        f: 0.0
        f: 0.03
      }
    }
  }
  attr {
    key: "params_a_name"
    value {
      list {
        s: "translate"
        s: "rotate"
        s: "zoom"
        s: "squeeze"
        s: "noise"
      }
    }
  }
  attr {
    key: "params_a_prob"
    value {
      list {
        f: 1.0
        f: 1.0
        f: 1.0
        f: 1.0
        f: 1.0
      }
    }
  }
  attr {
    key: "params_a_rand_type"
    value {
      list {
        s: "uniform_bernoulli"
        s: "uniform_bernoulli"
        s: "uniform_bernoulli"
        s: "uniform_bernoulli"
        s: "uniform_bernoulli"
      }
    }
  }
  attr {
    key: "params_a_spread"
    value {
      list {
        f: 0.4
        f: 0.4
        f: 0.4
        f: 0.3
        f: 0.03
      }
    }
  }
  attr {
    key: "params_b_coeff_schedule"
    value {
      list {
      }
    }
  }
  attr {
    key: "params_b_exp"
    value {
      list {
        b: false
        b: false
        b: true
        b: true
        b: false
        b: true
        b: true
      }
    }
  }
  attr {
    key: "params_b_mean"
    value {
      list {
        f: 0.0
        f: 0.0
        f: 0.0
        f: 0.0
        f: 0.0
        f: 0.0
        f: 0.0
      }
    }
  }
  attr {
    key: "params_b_name"
    value {
      list {
        s: "translate"
        s: "rotate"
        s: "zoom"
        s: "gamma"
        s: "brightness"
        s: "contrast"
        s: "color"
      }
    }
  }
  attr {
    key: "params_b_prob"
    value {
      list {
        f: 1.0
        f: 1.0
        f: 1.0
        f: 1.0
        f: 1.0
        f: 1.0
        f: 1.0
      }
    }
  }
  attr {
    key: "params_b_rand_type"
    value {
      list {
        s: "gaussian_bernoulli"
        s: "gaussian_bernoulli"
        s: "gaussian_bernoulli"
        s: "gaussian_bernoulli"
        s: "gaussian_bernoulli"
        s: "gaussian_bernoulli"
        s: "gaussian_bernoulli"
      }
    }
  }
  attr {
    key: "params_b_spread"
    value {
      list {
        f: 0.03
        f: 0.03
        f: 0.03
        f: 0.02
        f: 0.02
        f: 0.02
        f: 0.02
      }
    }
  }
}
node {
  name: "load_batch/Const"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "load_batch/Const_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03
      }
    }
  }
}
node {
  name: "load_batch/mul/x"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03
      }
    }
  }
}
node {
  name: "load_batch/mul"
  op: "Mul"
  input: "load_batch/mul/x"
  input: "load_batch/Const"
  device: "/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
